# Brewfile — run `brew bundle` to install everything

# ── Shell ──────────────────────────────────────────────────────────────────
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "starship"

# ── Terminal ──────────────────────────────────────────────────────────────
brew "tmux"
cask "ghostty"

# ── Editors ───────────────────────────────────────────────────────────────
brew "neovim"
cask "visual-studio-code"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "charliermarsh.ruff"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "meta.pyrefly"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.symbols"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"

# ── Git ───────────────────────────────────────────────────────────────────
brew "git"
brew "gh"
brew "lazygit"

# ── File manager ──────────────────────────────────────────────────────────
brew "yazi"
brew "fd"
brew "fzf"

# ── CLI utilities ─────────────────────────────────────────────────────────
brew "bat"
brew "eza"
brew "fastfetch"
brew "jq"
brew "ripgrep"
brew "trash"
brew "tree"

# ── Development ───────────────────────────────────────────────────────────
brew "node"
brew "pnpm"
brew "uv"
brew "deno"
brew "biome"
brew "ruff"

# ── Media / Docs ──────────────────────────────────────────────────────────
brew "pandoc"
brew "yt-dlp"

# ── DevOps ────────────────────────────────────────────────────────────────
brew "lazydocker"
brew "kubectl"

# ── Fonts ─────────────────────────────────────────────────────────────────
cask "font-symbols-only-nerd-font"
cask "font-maple-mono-normal-nf-cn"
