# Brewfile — run `brew bundle` to install everything

# ── Shell ──────────────────────────────────────────────────────────────────
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "starship"

# ── Terminal ──────────────────────────────────────────────────────────────
brew "tmux"
cask "ghostty"

# ── Editors ───────────────────────────────────────────────────────────────
brew "neovim"

# ── Git ───────────────────────────────────────────────────────────────────
brew "git"
brew "gh"
brew "lazygit"

# ── File manager ──────────────────────────────────────────────────────────
brew "yazi"
brew "fd"
brew "fzf"

# ── CLI utilities ─────────────────────────────────────────────────────────
brew "bat"
brew "eza"
brew "fastfetch"
brew "jq"
brew "ripgrep"
brew "trash"
brew "tree"

# ── Development ───────────────────────────────────────────────────────────
brew "node"
brew "uv"
brew "deno"

# ── Media / Docs ──────────────────────────────────────────────────────────
brew "pandoc"
brew "yt-dlp"

# ── DevOps ────────────────────────────────────────────────────────────────
brew "lazydocker"
brew "kubectl"

# ── Fonts ─────────────────────────────────────────────────────────────────
cask "font-symbols-only-nerd-font"
cask "font-maple-mono-normal-nf-cn"
